
#Область ОбработчикСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Код = "https://salexdv.github.io/bsl_console/index.html";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
		
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогОткрытияФайла.Фильтр 			   = "Внешние обработки (*.epf)|*.epf";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок 		   = НСтр("ru = 'Выберите внешнюю обработку'");	
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ПутьКФайлу", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла",ДиалогОткрытияФайла)));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыОшибки

&НаКлиенте
Процедура ОшибкиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтроки = ТекущиеДанные.НомерСтроки;
	Поле = Элементы.Код;
	ТекстПоля = Код;
	
	МассивСтрок = СтрРазделить(ТекстПоля, Символы.ПС, Истина);
	
	Если НомерСтроки < 1 Или НомерСтроки > МассивСтрок.Количество() Тогда
		Сообщить("Указанная строка не существует!");
		Возврат;
	КонецЕсли;
	
	НачалоСтроки = 0;
	Для Индекс = 0 По НомерСтроки - 2 Цикл
		НачалоСтроки = НачалоСтроки + СтрДлина(МассивСтрок[Индекс]) + 1; 
	КонецЦикла;
	
	ДлинаСтроки = СтрДлина(МассивСтрок[НомерСтроки - 1]);
	
	Поле.УстановитьГраницыВыделения(НачалоСтроки + 1, НачалоСтроки + ДлинаСтроки + 1);
	
	ЭтотОбъект.ТекущийЭлемент = Поле;
	
	ОбновитьОтображениеДанных(Поле);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
	
	Обработчик = Новый ОписаниеОповещения("ПослеЗакрытияФормы", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПутьКv8unpack", ПутьКv8unpack);
	ПараметрыФормы.Вставить("АдресSonar", АдресSonar);
	ПараметрыФормы.Вставить("ПортSonar", ПортSonar);
	ПараметрыФормы.Вставить("ТокенSonar", ТокенSonar);
	
	ОткрытьФорму("ВнешняяОбработка.SonarQube.Форма.ФормаНастройки", ПараметрыФормы , , , , , Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПутьКФайлу(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 
	
	ПапкаДляBSL		   = "ПутьГдеФайлыBSL";
	ПутьКPythonСкрипту = "ПутьКСкрипту";
	ПутьКPython 	   = "python";
	
	ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
		ПутьКФайлуBSL = ИзвлечьКодИзEPF(ПутьКФайлу, ПапкаДляBSL, ПутьКPython, ПутьКPythonСкрипту);
		ВставитьКодВСтроку(ПутьКФайлуBSL);
		ОтправитьКодНаАнализ(ПутьКФайлуBSL);
		
	Иначе
		ПоказатьПредупреждение(Неопределено,"Файл не выбран!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьКодВСтроку(ПутьКФайлуBSL)
	
	Текст = Новый ЧтениеТекста(ПутьКФайлуBSL, КодировкаТекста.UTF8);
	КодТекст = Текст.Прочитать();
	Текст.Закрыть();
	Код = КодТекст;
	
КонецПроцедуры

&НаСервере
Функция ИзвлечьКодИзEPF(ПутьКФайлуEPF, ПапкаДляBSL, ПутьКPython, ПутьКPythonСкрипту)
	
	Попытка
		ФайлEPF = Новый Файл(ПутьКФайлуEPF);
		
		Если НЕ ФайлEPF.Существует() ИЛИ ФайлEPF.Расширение <> ".epf" Тогда
			ВызватьИсключение "Указан неверный файл";
		КонецЕсли;
		
		ФайлPython = Новый Файл(ПутьКPythonСкрипту);
		
		Если НЕ ФайлPython.Существует() ИЛИ ФайлPython.Расширение <> ".py" Тогда
			ВызватьИсключение "Нет скрипта на Python";
		КонецЕсли;
		
		СоздатьКаталог(ПапкаДляBSL);
		
		ВременнаяПапка = ПолучитьИмяВременногоФайла("");
		СоздатьКаталог(ВременнаяПапка);
		ЛогФайл = ВременнаяПапка + "\log.txt";
		
		
		Команда = СтрШаблон(
		"cmd.exe /C """"%1"" ""%2"" --epf=""%3"" --out=""%4"" > ""%5"" 2>&1""",
		ПутьКPython,
		ПутьКPythonСкрипту,
		ПутьКФайлуEPF,
		ВременнаяПапка,
		ЛогФайл);
		
		КодВозврата = 0;
		ЗапуститьПриложение(Команда,,Истина, КодВозврата);
		
		Если КодВозврата <> 0 Тогда
			ЧтениеЛога = Новый ЧтениеТекста(ЛогФайл, "UTF-8@");
			ТекстОшибки = ЧтениеЛога.Прочитать();
			ЧтениеЛога.Закрыть();
			ВызватьИсключение "Ошибка при выполнение Python скрипта" + ТекстОшибки;
		КонецЕсли;
		
		ФайлBSL = СобратьBSLФайлы(ВременнаяПапка, ПапкаДляBSL, ФайлEPF.ИмяБезРасширения);
		
		УдалитьФайлы(ВременнаяПапка);
		
		Возврат ФайлBSl;
		
	Исключение
		ВызватьИсключение "Ошибка обработки: " + ОписаниеОшибки();
	КонецПопытки
	
КонецФункции

&НаСервере
Функция СобратьBSLФайлы(ВременнаяПапка, ПапкаДляBSL, ИмяФайла)
	
	Файлы = НайтиФайлы(ВременнаяПапка,"*.bsl", Истина);
	
	Для Каждого Файл Из Файлы Цикл
		ОтносительныйПуть = СтрЗаменить(Файл.ПолноеИмя, ВременнаяПапка, "");
		Если СтрНачинаетсяС(ОтносительныйПуть, "\") Тогда 
			ОтносительныйПуть = Сред(ОтносительныйПуть, 2);	
		КонецЕсли;
		
		НовыйПуть = ПапкаДляBSL + "\" + ИмяФайла + ".bsl";
		
		КопироватьФайл(Файл.ПолноеИмя, НовыйПуть);
		
		Возврат НовыйПуть;
	КонецЦикла
	
КонецФункции

#Область SonarQube

&НаСервере
Функция СоздатьПроектSonarQube(Токен, КлючПроекта, ИмяПроекта)
	
	СтрокаАвторизации = Токен + ":";
	БазоваяАвторизация = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(СтрокаАвторизации));
	ЗаголовокАвторизации = "Basic " + БазоваяАвторизация;
	
	HTTPСоединение = Новый HTTPСоединение("localhost",9000);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", ЗаголовокАвторизации);
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	ТелоЗапроса = "name=" + КодироватьСтроку(ИмяПроекта, СпособКодированияСтроки.URLВКодировкеURL) +
	"&project=" + КодироватьСтроку(КлючПроекта, СпособКодированияСтроки.URLВКодировкеURL);
	
	HTTPЗапрос = Новый HTTPЗапрос("/api/projects/create");
	HTTPЗапрос.Заголовки = Заголовки;
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	Попытка
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			Возврат HTTPОтвет.ПолучитьТелоКакСтроку();
		Иначе
			Возврат "Ошибка: " + HTTPОтвет.КодСостояния + " - " + HTTPОтвет.ПолучитьТелоКакСтроку();
		КонецЕсли;
		
	Исключение
		Возврат "Исключение: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ОтправитьКодНаАнализ(ПутьКФайлуBSL)
	
	ФайлBSL = Новый Файл(ПутьКФайлуBSL);
	
	ПутьКSonarScanner = "ПутьКSonarScanner";
	Сервер 			  = "Сервер";
	Токен 			  = "Токен";
	
	ИмяПроекта   = ФайлBSL.ИмяБезРасширения;
	КлючПроекта  = СтрЗаменить(ФайлBSL.ИмяБезРасширения,"-","");
	КлючПроекта  = СтрЗаменить(КлючПроекта,"ПМ_","");
	ПутьКПроекту = СтрЗаменить(ПутьКФайлуBSL, ФайлBSL.Имя, "");
	
	ЕстьЛиПроекта = ПроверитьЕстьЛиПроектSonarQube(ИмяПроекта, Токен);
	
	Если НЕ ЕстьЛиПроекта Тогда
		Результат = СоздатьПроектSonarQube(Токен, КлючПроекта, ИмяПроекта);	 
	КонецЕсли;
	
	ПроверкаКода = ЗапуститьАнализSonarQube(ПутьКSonarScanner, ФайлBSL, КлючПроекта, Сервер, Токен);
	
	taskId = ЗапуститьАнализИПолучитьTaskId(ПутьКSonarScanner, ФайлBSL, КлючПроекта, Сервер, Токен);
	Если ТипЗнч(taskId) <> Тип("Строка") Или СтрНайти(taskId, "Ошибка") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОжидатьИПолучитьIssues(Сервер, Токен, КлючПроекта, taskId);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЕстьЛиПроектSonarQube(ИмяПроекта, Токен);
	
	HTTPСоединение = Новый HTTPСоединение("localhost",9000);
	
	ПутьAPI = "/api/projects/search";
	
	ПараметрыЗапроса = Новый Соответствие;
	ПараметрыЗапроса.Вставить("q", ИмяПроекта);
	URL = ПутьAPI + "?" + СформироватьПараметрыЗапроса(ПараметрыЗапроса);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Bearer " + Токен);
	
	HTTPЗапрос = Новый HTTPЗапрос(URL, Заголовки);
	
	Попытка
		
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			
            ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
            ЧтениеJSON = Новый ЧтениеJSON;
            ЧтениеJSON.УстановитьСтроку(ТекстОтвета);
            Данные = ПрочитатьJSON(ЧтениеJSON, Истина);
            ЧтениеJSON.Закрыть();
            
            Если Данные["components"] <> Неопределено Тогда
                Для Каждого Компонент Из Данные["components"] Цикл
                    Если ВРег(Компонент["name"]) = ВРег(ИмяПроекта) Тогда
                        Возврат Истина;
                    КонецЕсли;
                КонецЦикла;
            КонецЕсли;
        Иначе
            ВызватьИсключение "Ошибка при запросе к SonarQube: Код состояния " + HTTPОтвет.КодСостояния;
        КонецЕсли;
    Исключение
        Сообщить("Ошибка: " + ОписаниеОшибки());
        Возврат Ложь;
    КонецПопытки;
    
    Возврат Ложь;

КонецФункции

&НаСервере
Функция СформироватьПараметрыЗапроса(Параметры)
	
    МассивПараметров = Новый Массив;
    Для Каждого КлючЗначение Из Параметры Цикл
        МассивПараметров.Добавить(КлючЗначение.Ключ + "=" + КодироватьСтроку(Строка(КлючЗначение.Значение), СпособКодированияСтроки.КодировкаURL));
    КонецЦикла;
    Возврат СтрСоединить(МассивПараметров, "&");
	
КонецФункции

&НаСервере
Функция ЗапуститьАнализИПолучитьTaskId(ПутьКSonarScanner, ФайлBSL, КлючПроекта, Сервер, Токен)
	
	ПутьКПроекту = Лев(ФайлBSL.Путь, СтрДлина(ФайлBSL.Путь) - 1);
	ИмяФайла = ФайлBSL.Имя;
	
	Команда = """" + ПутьКSonarScanner + """ -Dsonar.projectKey=" + КлючПроекта +
	          " -Dsonar.host.url=" + Сервер +
	          " -Dsonar.token=" + Токен +
	          " -Dsonar.projectBaseDir=""" + ПутьКПроекту + """" +
			  " -Dsonar.sources=""" + ИмяФайла + """ " +
	          " -Dsonar.language=bsl" +
	          " -Dsonar.bsl.file.suffixes=.bsl" +
	          " -Dsonar.bsl.languageserver.enabled=true" +
	          " -Dsonar.bsl.languageserver.skipSupport=never" +
	          " -Dsonar.scm.disabled=true" +
	          " -Dsonar.sourceEncoding=UTF-8" +
	          " -X";
		
	КомандаСистемы = Новый COMОбъект("WScript.Shell");
	
	Попытка
		Результат = КомандаСистемы.Run(Команда, 0, Истина);
		Если Результат <> 0 Тогда
			Возврат "Ошибка выполнения сканера: Код " + Строка(Результат);
		КонецЕсли;
	Исключение
		Возврат "Исключение при запуске: " + ОписаниеОшибки();
	КонецПопытки;
	
	ФайлОтчета = ПутьКПроекту + "\.scannerwork\report-task.txt";
	ТекстОтчета = Новый ЧтениеТекста(ФайлОтчета, "UTF-8");
	СтрокаОтчета = ТекстОтчета.ПрочитатьСтроку();
	
	Пока СтрокаОтчета <> Неопределено Цикл
		Если СтрНайти(СтрокаОтчета, "ceTaskId=") > 0 Тогда
			taskId = Сред(СтрокаОтчета, СтрНайти(СтрокаОтчета, "=") + 1);
			ТекстОтчета.Закрыть();
			Возврат taskId;
		КонецЕсли;
		СтрокаОтчета = ТекстОтчета.ПрочитатьСтроку();
	КонецЦикла;
	
	ТекстОтчета.Закрыть();
	Возврат "Ошибка: taskId не найден в отчете";
	
КонецФункции

&НаСервере
Функция ПроверитьСтатусАнализа(Сервер, Токен, taskId)
	
	СтрокаАвторизации = Токен + ":";
	БазоваяАвторизация = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(СтрокаАвторизации));
	ЗаголовокАвторизации = "Basic " + БазоваяАвторизация;
	
	HTTPСоединение = Новый HTTPСоединение("localhost",9000);
	
	Ресурс = "/api/ce/task?id=" + taskId;
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", ЗаголовокАвторизации);
	Заголовки.Вставить("Accept", "application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс, Заголовки);
	
	Попытка
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			JSONСтрока = HTTPОтвет.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(JSONСтрока);
			Данные = ПрочитатьJSON(ЧтениеJSON, Истина);
			ЧтениеJSON.Закрыть();
			Возврат Данные.Получить("task").Получить("status");
		Иначе
			Возврат "Ошибка: " + HTTPОтвет.КодСостояния;
		КонецЕсли;
	Исключение
		Возврат "Исключение: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ЗапуститьАнализSonarQube(ПутьКSonarScanner, ФайлBSL, КлючПроекта, Сервер, Токен)
	
	Файл = Новый Файл(ПутьКSonarScanner);
	Если НЕ Файл.Существует() Тогда
		Возврат "Ошибка: SonarScanner не найден";
	КонецЕсли;

	ПутьКПроекту = Лев(ФайлBSL.Путь, СтрДлина(ФайлBSL.Путь) - 1);
	ИмяФайла = ФайлBSL.Имя;
	
	Команда = """" + ПутьКSonarScanner + """ -Dsonar.projectKey=" + КлючПроекта +
	" -Dsonar.host.url=" + Сервер +
	" -Dsonar.token=" + Токен +
	" -Dsonar.projectBaseDir=""" + ПутьКПроекту + """" +
	" -Dsonar.sources=""" + ИмяФайла + """ " +
	" -Dsonar.language=bsl" +
	" -Dsonar.bsl.file.suffixes=.bsl" +
	" -Dsonar.bsl.languageserver.enabled=true" +
	" -Dsonar.bsl.languageserver.skipSupport=never" +
	" -Dsonar.scm.disabled=true" +  
	" -Dsonar.sourceEncoding=UTF-8" +
	" -X"; 
		
	КомандаСистемы = Новый COMОбъект("WScript.Shell");
	
	Попытка
		Результат = КомандаСистемы.Run(Команда, 0, Истина);
		Если Результат = 0 Тогда
			Возврат "Анализ завершен";
		Иначе
			Возврат "Ошибка: Код " + Строка(Результат);
		КонецЕсли;
	Исключение
		Возврат "Исключение: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ОжидатьИПолучитьIssues(Сервер, Токен, КлючПроекта, taskId)
	
	Таймаут = 300;  
	Интервал = 5; 
	ПрошлоВремени = 0;
	
	Пока Истина Цикл
		
		Статус = ПроверитьСтатусАнализа(Сервер, Токен, taskId);
		
		Если Статус = "SUCCESS" Тогда
			Результат = ПолучитьЗамечанияSonarQube(Сервер, Токен, КлючПроекта);
			Возврат;
		ИначеЕсли Статус = "FAILED" Тогда
			Сообщить("Анализ провалился!");
			Возврат;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗамечанияSonarQube(Сервер, Токен, КлючПроекта)
	
	Результат = "";
	
	СтрокаАвторизации = Токен + ":";
	БазоваяАвторизация = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(СтрокаАвторизации));
	ЗаголовокАвторизации = "Basic " + БазоваяАвторизация;
	
	HTTPСоединение = Новый HTTPСоединение("localhost",9000);
	
	НомерСтраницы = 1;
	РазмерСтраницы = 100;
	ЕстьЕщеДанные = Истина;
	
	Пока ЕстьЕщеДанные Цикл
		
		Ресурс = "/api/issues/search?componentKeys=" + КлючПроекта + "&ps=" + Формат(РазмерСтраницы, "ЧГ=0") + "&p=" + Формат(НомерСтраницы, "ЧГ=0");
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Authorization", ЗаголовокАвторизации);
		Заголовки.Вставить("Accept", "application/json");
		
		HTTPЗапрос = Новый HTTPЗапрос(Ресурс, Заголовки);
		
		Попытка
			HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
			Если HTTPОтвет.КодСостояния = 200 Тогда
				JSONСтрока = HTTPОтвет.ПолучитьТелоКакСтроку();
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(JSONСтрока);
				Данные = ПрочитатьJSON(ЧтениеJSON, Истина);
				ЧтениеJSON.Закрыть();
				
				Issues = Данные.Получить("issues");
				Если Issues = Неопределено Или Issues.Количество() = 0 Тогда
					Результат = Результат + "Замечания не найдены." + Символы.ПС;
					Прервать;
				КонецЕсли;
				
				Номер = 1;
				
				Для Каждого Issue Из Issues Цикл
					Файл = Issue.Получить("component");
					Строка = Формат(Issue.Получить("line"), "ЧГ=0");
					Тип = ТипОшибки(Issue.Получить("type")); 
					Сообщение = Issue.Получить("message");
					Серьезность = Issue.Получить("severity");
					
					НоваяСтрока = Ошибки.Добавить();
					НоваяСтрока.Номер = Номер;
					НоваяСтрока.ТекстОшибки = Сообщение;
					НоваяСтрока.НомерСтроки = Строка;
					НоваяСтрока.ТипОшибки   = Тип;
					
					Номер = Номер + 1;
					
				КонецЦикла;
				
				Total = Данные.Получить("total");
				Обработано = НомерСтраницы * РазмерСтраницы;
				ЕстьЕщеДанные = Обработано < Total;
				НомерСтраницы = НомерСтраницы + 1;
				Ошибки.Сортировать("Тип", "Ошибка");
				
			Иначе
				
				Результат = Результат + "Ошибка API: Код " + HTTPОтвет.КодСостояния + Символы.ПС;
				Прервать;
				
			КонецЕсли;
		Исключение
			
			Результат = Результат + "Исключение при запросе issues: " + ОписаниеОшибки() + Символы.ПС;
			Прервать;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТипОшибки(Тип)
	
	Если Тип = "CODE_SMELL" Тогда
		Возврат "Предупреждение"
	ИначеЕсли Тип = "BUG" Тогда
		Возврат "Ошибка";
	КонецЕсли;

КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ПослеЗакрытияФормы(Настройки, ДополнительныеПараметры) Экспорт

	Если Настройки = Неопределено Тогда
        Возврат;
    КонецЕсли;

    ПутьКv8unpack = Настройки.ПутьКv8unpack;
    АдресSonar    = Настройки.АдресSonar;
    ПортSonar     = Настройки.ПортSonar;
    ТокенSonar    = Настройки.ТокенSonar;

КонецПроцедуры

#КонецОбласти

