
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    ПутьКv8unpack = Параметры.ПутьКv8unpack;
    АдресSonar    = Параметры.АдресSonar;
    ПортSonar     = Параметры.ПортSonar;
    ТокенSonar    = Параметры.ТокенSonar;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКv8unpackНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
		
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогОткрытияФайла.Фильтр 			   = "Исполняемые файлы (*.exe)|*.exe";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок 		   = НСтр("ru = 'Выберите файл v8unpack.exe'");
	
	ДополнительныеПараметры = Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла);
	
	ОписаниеЗавершения = Новый ОписаниеОповещения("ПутьКv8unpack", ЭтотОбъект, ДополнительныеПараметры);
	
	ДиалогОткрытияФайла.Показать(ОписаниеЗавершения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Настройки = Новый Структура;
	
    Настройки.Вставить("ПутьКv8unpack", ПутьКv8unpack);
    Настройки.Вставить("АдресSonar", АдресSonar);
    Настройки.Вставить("ПортSonar", ПортSonar);
    Настройки.Вставить("ТокенSonar", ТокенSonar);

    Закрыть(Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПутьКv8unpack(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

   	ПутьКv8unpack = ДополнительныеПараметры.ДиалогОткрытияФайла.ПолноеИмяФайла;

КонецПроцедуры

#КонецОбласти
